{
    "person": {
        "role": "Full Stack Developer"
    },
    "newsletter": {
        "title": "Subscribe to {firstName}'s Newsletter",
        "description": "I occasionally write about design, technology, and share thoughts on the intersection of creativity and engineering",
        "button": "Sign up"
    },
    "home": {
        "label": "Home",
        "title": "{name}'s Portfolio",
        "description": "Portfolio website showcasing my work as a {role}",
        "headline": "Welcome to {person.firstName}'s Portfolio",
        "subline": "I'm a creative problem solver who thrives on the intersection of design and engineering."
    },
    "about": {
        "label": "About",
        "title": "About me",
        "description": "Meet {name}, {role} from {location}",
        "intro": {
            "title": "Introduction",
            "description": "I'm a passionate developer with over 5 years of experience in bringing success to teams by building great relationships and understanding the needs of clients to build high-performing custom digital solutions. I have a proven history of engineering bespoke web application features and crafting user-friendly designs and components. I'm an avid mentor and open-source contributor, passionate about sharing knowledge and giving back to the development community. My work spans digital interfaces, interactive experiences, and the convergence of design and technology."
        },
        "work": {
            "title": "Work Experience",
            "experiences": {
                "Nularian": {
                    "timeframe": "2025",
                    "role": "Full Stack Engineer",
                    "achievements": "Designed and developed a scalable, user-centric interface for Nularian Electrify's AI-automated workflow, resulting in a 25% increase in customer engagement and a 15% reduction in customer support tickets.;Integrated LLM-powered solutions with Nularian Electrify's workflow, resulting in an average of 50% decrease in time-to-value for AI-automated tasks."
                },
                "Blu Omega Consulting": {
                    "timeframe": "2024",
                    "role": "Full Stack Developer",
                    "achievements": "Contributed to a federal project team that rebuilt the National Heart, Lung, and Blood Institute website using Agile methodologies and a DevOps toolset on Microsoft Azure, resulting in a 30% increase in user engagement and a 25% increase in website accessibility compliance.;Cleaned up legacy code resulting in a 25% reduction in total repository size, modernizing the codebase and reducing technical debt."
                },
                "Business Enterprise Institute": {
                    "timeframe": "2021 - 2022",
                    "role": "Full Stack Developer",
                    "achievements": "Developed and maintained custom web applications using React, Node.js, and PostgreSQL, resulting in a 40% increase in user engagement.;Implemented automated testing and continuous integration pipelines, reducing deployment time by 60% and improving code quality."
                }
            }
        },
        "studies": {
            "title": "Studies",
            "institutions": {
                "Western Colorado University": {
                    "description": "Bachelor of Science, Computer Science"
                },
                "State University of New York at Purchase": {
                    "description": "Bachelor of Arts, Media and Communications"
                }
            }
        },
        "technical": {
            "title": "Technical skills",
            "skills": {
                "Figma": {
                    "description": "Able to prototype in Figma with Once UI with unnatural speed."
                },
                "Nextjs": {
                    "description": "Building next gen apps with Next.js + Once UI + Supabase."
                }
            }
        }
    },
    "blog": {
        "label": "Blog",
        "title": "Writing about design and tech...",
        "description": "Read what {name} has been up to recently"
    },
    "work": {
        "label": "Work",
        "title": "My projects",
        "description": "Design and dev projects by {name}"
    },
    "gallery": {
        "label": "Gallery",
        "title": "My photo gallery",
        "description": "A photo collection by {name}"
    },
    "projectCard": {
        "label": "Read Case Study"
    }
}