[
  {
    "metadata": {
      "title": "Transforming Financial Education: How I Automated Certification for 2,000+ Exit Planning Advisors",
      "publishedAt": "2021-05-01",
      "summary": "Engineered an enterprise learning management system and SEO-optimized website that transformed BEI's digital presence and expanded their nationwide reach.",
      "images": [
        "/images/projects/financial-planning/cover-01.jpg",
        "/images/projects/financial-planning/cover-02.jpg",
        "/images/projects/financial-planning/cover-03.png",
        "/images/projects/financial-planning/cover-04.jpg"
      ],
      "team": [
        {
          "name": "Eric Swanson",
          "role": "Software Engineer",
          "avatar": "/images/avatar.jpg",
          "linkedIn": "https://www.linkedin.com/in/ericsdesign"
        }
      ],
      "tags": [
        "enterprise",
        "drupal development",
        "backend",
        "frontend",
        "lms"
      ]
    },
    "slug": "bei-drupal-development",
    "content": "\n# Overview\n\nAt Business Enterprise Institute (BEI), I engineered a comprehensive digital training platform that revolutionized how financial planners learn about exit planning strategies. I architected a custom Learning Management System (LMS) integration with Drupal that automated the entire certification process, from enrollment to final certification, enabling BEI to scale their training program nationwide.\n\nThe platform I built featured interactive course modules, automated assessment tracking, and a sophisticated certification management system. By implementing real-time progress tracking and automated certification verification, we streamlined what was previously a manual process, enabling BEI to efficiently train and certify over 2,000 financial planners across the country. This digital transformation led to a 20% increase in revenue through expanded reach and improved operational efficiency.\n\nTo maximize the platform's reach, I implemented an SEO-optimized content strategy that significantly improved BEI's visibility in the exit planning space. Through technical optimizations and strategic content structuring, I helped BEI achieve top rankings for key industry terms like \"Exit Planning,\" driving qualified traffic to both the training platform and main website. The improved digital presence, combined with an intuitive user interface designed in Figma and implemented in Drupal, resulted in a 15% expansion of BEI's professional network.\n\n## Key Features\n\n- **Enterprise LMS Integration:** Engineered a custom Drupal-LMS integration that automated the certification process for thousands of financial planners, with features for progress tracking, assessment automation, and certification management.\n- **SEO-Optimized Architecture:** Implemented technical SEO optimizations that achieved top rankings for industry-specific keywords, significantly improving visibility and lead generation.\n- **User Experience Design:** Created an intuitive learning interface with progress tracking, interactive assessments, and automated certification delivery, leading to high completion rates and positive user feedback.\n\n## Technologies Used\n\n- **Drupal & PHP:** Core platform development with custom modules for LMS integration\n- **MySQL & Redis:** Database management and caching for optimal performance\n- **JavaScript & React.js:** Interactive course features and real-time progress tracking\n\n## Challenges and Learnings\n\nThe primary technical challenge was architecting a seamless integration between the LMS and Drupal systems while maintaining data consistency across both platforms. This required developing custom Drupal modules for real-time synchronization and implementing caching strategies with Redis to ensure optimal performance under high user load. Additionally, we needed to design a scalable database architecture that could handle concurrent access from thousands of users while maintaining quick response times for course progress tracking and certification verification.\n\n## Outcome\n\nThe digital training platform transformed BEI's business model, enabling them to:\n- Scale their certification program to train 2,000+ financial planners nationwide\n- Achieve 20% revenue growth through automated training and certification processes\n- Reach top Google rankings for \"Exit Planning\" and related industry terms\n- Expand their professional network by 15% through improved digital presence\n- Significantly reduce operational costs by automating previously manual certification processes\n"
  },
  {
    "metadata": {
      "title": "Leading Colorado's First Multi-Institution Climate Initiative: An Award-Winning Platform for Rural Communities",
      "publishedAt": "2020-09-11",
      "summary": "Spearheaded a groundbreaking collaboration between Western Colorado University and Colorado School of Mines to create an award-winning climate action platform for rural communities.",
      "images": [
        "/images/projects/climate-action/cover-01.jpg",
        "/images/projects/climate-action/cover-02.png",
        "/images/projects/climate-action/cover-03.png",
        "/images/projects/climate-action/cover-04.png"
      ],
      "team": [
        {
          "name": "Eric Swanson",
          "role": "Full-Stack Developer & Technical Consultant",
          "avatar": "/images/avatar.jpg",
          "linkedIn": "https://www.linkedin.com/in/ericsdesign"
        }
      ],
      "tags": [
        "full-stack",
        "python",
        "flask",
        "google maps",
        "data visualization",
        "climate tech"
      ]
    },
    "slug": "climate-action-planning",
    "content": "\n# Overview\n\nI led the technology efforts in Colorado’s first cross-institutional climate initiative, uniting environmental experts from Western Colorado University and engineers from the Colorado School of Mines to create the Tiny Feet Toolkit. This groundbreaking collaboration bridged the gap between environmental science and software engineering, resulting in an innovative platform that democratizes climate action planning for rural communities.\nAs technical lead, I directed a diverse team of seven engineers (the \"30% crew\") while working closely with environmental management experts to translate complex climate science into actionable software solutions. Our unique interdisciplinary approach earned the project a $2,000 grant and recognition as a model for future cross-institutional climate initiatives in Colorado.\n\nThe platform we developed represents a first-of-its-kind tool that combines environmental expertise with advanced data visualization, making sophisticated climate planning accessible to rural communities with limited resources. By bringing together academic institutions, environmental scientists, and engineers, we created a sustainable framework for future collaborative climate action projects.\n\n## Key Features\n\n- **Cross-Institutional Data Integration:** Engineered a system that combines environmental data from multiple academic institutions, creating a comprehensive climate planning resource for rural communities.\n\n- **Interactive Climate Visualization:** Developed sophisticated mapping and data visualization tools using Google Maps API and D3.js, enabling communities to understand and analyze their environmental impact through intuitive interfaces.\n\n- **Collaborative Decision Support:** Built features that facilitate knowledge sharing between communities, allowing them to learn from successful climate initiatives and adapt strategies to their local context.\n\n- **Rural-Focused Design:** Created an accessible platform specifically tailored to the needs and resources of rural communities, with offline capabilities and low-bandwidth optimizations.\n\n## Technologies Used\n\n- **Python Flask:** Backend framework for handling complex data processing and API integrations\n- **Google Maps API & D3.js:** For creating interactive maps and data visualizations\n- **MySQL:** Robust database system for managing environmental and community data\n- **Redis:** Caching layer for optimizing performance in low-bandwidth environments\n\n## Challenges and Learnings\n\nThe project's main challenge was coordinating between multiple institutions and disciplines, each with different approaches to climate action planning. We overcame this by establishing clear communication channels and developing a shared technical vocabulary between environmental scientists and software engineers. This experience provided valuable insights into managing cross-disciplinary teams and translating scientific requirements into technical solutions.\n\n## Impact\n\nOur cross-institutional collaboration achieved several significant outcomes:\n- Created Colorado's first inter-institutional climate technology platform\n- Received grant funding validating the project's innovative approach\n- Established a replicable model for future academic-technical collaborations\n- Provided rural communities with previously inaccessible climate planning tools\n- Set a precedent for how academic institutions can work together on climate initiatives\n"
  },
  {
    "metadata": {
      "title": "Securing High-End Bicycle Deliveries at America's First Bike-Only Logistics Company",
      "publishedAt": "2022-06-01",
      "summary": "Developed a real-time photo verification system for Kitzuma Cycling Logistics, ensuring safe delivery of thousands of high-end bicycles nationwide while driving significant business growth.",
      "images": [
        "/images/projects/kitzuma/cover-01.jpg",
        "/images/projects/kitzuma/cover-02.png",
        "/images/projects/kitzuma/cover-03.jpg",
        "/images/projects/kitzuma/cover-04.jpg"
      ],
      "team": [
        {
          "name": "Eric Swanson",
          "role": "Full Stack Engineer",
          "avatar": "/images/avatar.jpg",
          "linkedIn": "https://www.linkedin.com/in/ericsdesign"
        }
      ],
      "tags": [
        "salesforce",
        "vue.js",
        "frontend",
        "backend",
        "tms",
        "figma"
      ]
    },
    "slug": "kitzuma-cycling-logistics",
    "content": "\n# Overview\n\nAt Kitzuma Cycling Logistics, America's first bike-only logistics company, I developed an innovative photo verification system that transformed how high-end bicycles are delivered nationwide. The system requires drivers to photograph each bike at pickup and delivery, documenting its condition and ensuring safe handling throughout the journey. This visual confirmation process, integrated into our custom Salesforce-based Transportation Management System (TMS), provides customers with peace of mind when shipping bicycles worth thousands of dollars.\n\nThe photo verification feature was built into a custom mobile interface for drivers, automatically notifying customers with visual proof of their bike's condition at key touchpoints. This transparency led to a significant increase in customer trust and repeat business, particularly from high-end bicycle manufacturers and retailers who require documented proof of careful handling. The system processes thousands of deliveries monthly, with each bike's journey fully documented through our verification process.\n\nBeyond the verification system, I engineered a modern Vue.js marketing platform that integrated seamlessly with our TMS. This allowed customers to instantly book deliveries and track their bikes throughout the shipping process. The platform's success was evident in the numbers: we saw a 25% increase in lead conversions and a 15% growth in business volume, largely attributed to the trust built through our transparent delivery verification system.\n\n## Key Features\n\n- **Real-Time Delivery Verification System:** Engineered a sophisticated tracking system with photo verification capabilities, mobile driver interfaces, and automated customer notifications, driving a 15% increase in business through enhanced transparency.\n\n- **Custom TMS Architecture:** Developed a scalable Salesforce-based logistics platform handling thousands of monthly deliveries nationwide, with features like route optimization, delivery scheduling, and real-time status updates.\n\n- **High-Converting Marketing Platform:** Built a modern Vue.js website with dynamic pricing calculators and real-time availability checking, achieving a 25% increase in lead conversions through optimized user journeys and SEO.\n\n- **Quality Assurance Infrastructure:** Implemented comprehensive testing architecture with 70% code coverage, ensuring reliable operation of mission-critical delivery systems across the country.\n\n## Technologies Used\n\n- **Salesforce Platform:** Core backend for the Transportation Management System with custom Apex controllers and Lightning Web Components\n- **Vue.js & Java:** Frontend framework and backend services for the marketing platform\n- **Jest & Selenium:** Comprehensive testing suite for both frontend and backend systems\n"
  },
  {
    "metadata": {
      "title": "Building a Lightning-Fast Search Engine for California's $300B Transportation Projects",
      "publishedAt": "2023-10-01",
      "summary": "Engineered an advanced search system for the Rebuilding California website, enabling instant access to transportation project information across the state.",
      "images": [
        "/images/projects/rebuilding-california/cover-01.jpg",
        "/images/projects/rebuilding-california/cover-02.jpg"
      ],
      "team": [
        {
          "name": "Eric Swanson",
          "role": "Full Stack Developer (Contractor)",
          "avatar": "/images/avatar.jpg",
          "linkedIn": "https://www.linkedin.com/in/ericsdesign"
        }
      ],
      "tags": [
        "react",
        "gatsby",
        "typesense",
        "contentful",
        "arcgis",
        "enterprise"
      ]
    },
    "slug": "rebuilding-california",
    "content": "\n# Overview\n\nAs a contractor at Spruce Technology, I spearheaded the development of a sophisticated search system for the Rebuilding California website, making it easier for millions of California residents to find information about transportation projects in their area. The search engine I built indexes and provides instant access to details about billions of dollars worth of infrastructure projects across the state.\n\nMy primary focus was on creating a lightning-fast, typo-tolerant search experience that could handle complex queries across a vast database of transportation projects, documents, and resources. The implementation significantly improved the website's usability and made critical infrastructure information more accessible to the public.\n\n## Key Features\n\n- **Advanced Search Architecture:** Engineered a comprehensive search system using Typesense that delivers sub-50ms response times across millions of documents. Implemented features like typo tolerance, faceted search, and geospatial queries to help users quickly find relevant project information.\n\n- **Smart Indexing Strategy:** Designed an intelligent indexing system that automatically categorizes and prioritizes content based on relevance, project status, and location. This ensures users see the most pertinent results first, whether they're searching for specific projects, contractors, or locations.\n\n- **Enhanced User Experience:** Developed an intuitive search interface with auto-suggestions, filters, and real-time results that help users discover relevant content even when they're unsure of exact project names or locations. The system handles variations in spelling and terminology, ensuring users find what they need regardless of how they phrase their search.\n\n- **Interactive Map Modernization:** Successfully migrated and upgraded the ArcGIS mapping system from Web AppBuilder to Experience Builder, implementing modern mapping features that integrate seamlessly with the search functionality. This upgrade improved map interactivity and enhanced the visualization of project locations across California.\n\n## Technologies Used\n\n- **Typesense:** Core search engine powering the fast, typo-tolerant search experience\n- **React & Gatsby:** Frontend framework for building the search interface and results display\n- **ArcGIS Experience Builder:** Modern mapping platform for interactive project visualization\n- **GraphQL:** For efficient data fetching and real-time search results\n- **Node.js:** Backend services for search indexing and data processing\n"
  },
  {
    "metadata": {
      "title": "Social Brain Contacts - Relationship Management Reimagined",
      "publishedAt": "2023-06-01",
      "summary": "Developed a React Native mobile app that helps users manage their social relationships using social brain theory principles.",
      "images": [
        "/images/projects/social-brain/cover-01.jpg",
        "/images/projects/social-brain/cover-02.jpg",
        "/images/projects/social-brain/cover-03.jpg"
      ],
      "team": [
        {
          "name": "Eric Swanson",
          "role": "Full Stack Developer",
          "avatar": "/images/avatar.jpg",
          "linkedIn": "https://www.linkedin.com/in/ericsdesign"
        }
      ],
      "tags": [
        "mobile development",
        "react native",
        "expo",
        "social network",
        "full-stack"
      ]
    },
    "slug": "social-brain-contacts",
    "content": "\n# Overview\n\n\nSocial Brain Contacts is an innovative mobile application that I independently developed to revolutionize how people manage their social relationships. Built using React Native and Expo, the app leverages social brain theory to help users organize their contacts into meaningful groups based on relationship strength and type. This scientific approach helps users maintain healthier social connections by aligning with our brain's natural capacity for relationships.\n<br/>\n<div className=\"hover:cursor-pointer mb-8\">\n  <a href=\"https://www.socialbraincontacts.com/\" target=\"_blank\" rel=\"noopener noreferrer\" className=\"hover:cursor-pointer inline-block px-4 py-2 bg-blue-500 text-white rounded hover:bg-blue-600 transition-colors\">\n    Visit App Website\n  </a>\n</div>\nThe app addresses a fundamental challenge in our digital age: managing an ever-growing network of contacts while maintaining meaningful relationships. By incorporating insights from anthropology and neuroscience, particularly Dunbar's Number theory, the app helps users prioritize and maintain their most important relationships while keeping track of their broader social network.\n\n## Key Features\n\n- **Scientific Contact Organization:** Implemented contact grouping based on social brain theory and Dunbar's Number\n- **Contact Management:** Created an intuitive interface for organizing contacts into meaningful groups\n- **Cross-Platform Compatibility:** Ensured consistent performance across both iOS and Android platforms\n- **Privacy-Focused Design:** Built with user privacy as a core principle, ensuring personal data security\n\n## Technologies Used\n\n- **React Native & Expo:** For cross-platform mobile app development\n- **GitHub Actions:** For CI/CD pipeline and automated testing\n- **Firebase:** For secure backend services and data management\n- **Social Brain Theory:** For implementing scientifically-backed relationship management principles\n\n## Impact & Results\n\nThe app has made a significant impact in helping users better understand and manage their social relationships:\n\n- Successfully launched on both iOS and Android platforms\n- Achieved 200+ downloads across app stores\n- Maintained an active user base of 20+ regular users\n- Received valuable feedback from 30+ beta testers\n- Developed a comprehensive product website (socialbraincontacts.com) explaining the scientific principles behind the app\n\nThis project demonstrates my ability to translate complex scientific concepts into practical, user-friendly applications while maintaining high technical standards throughout the development process. It showcases my expertise in full-stack mobile development and my commitment to creating meaningful solutions that improve people's lives.\n"
  }
]